import React from "react";//, { useEffect, useContext,useState }
// import { MyContext } from "./Speek";
import pathitrupaathuimg1 from "./chera-img/pathitru-patthu-1png.png";
import pathittrupaathuimg2 from "./chera-img/pathittru-patthu-2-png.png";
import pathittrupaathuimg3 from "./chera-img/pathittru-patthu-3-png.png";
import ingurunooruck2 from "./chera-img/ingurunooru-c-k-2.png";
import nedunceralathan from "./chera-img/king.jpg";
import Navbar from "./chera-img/Navbar";


import "./Cherakings.css";

function C_k_2() {
 
  return (
    <>
      <div className="chera-main">
        <div className="cheradynustysubdiv"></div>
        <Navbar/>
        {/* content */}
        <div className="chera-content">
          <br />
          <div id="heading-main-div">
            <div className="heading-main-div">
              <h1 className="kingname"> நெடுஞ்சேரலாதன்</h1>
            </div>
          </div>

          
          <br />
          <div className="heading-div">
            <h3>இயர்பெயர் : </h3>
          </div>
          <p>
            "நெடுஞ்சேரலாதன்" இயர்பெயர் கிடைக்கவில்லை ஏனேனில் இது சங்க
            காலத்திலிருந்த புலவர் பாடல்களில் வந்த பெயர் என்பதால் பெரும்பாலும்
            பட்டப் பெயர் வடிவத்திலேயே காணப்படுகிறது.
          </p>
          <p>
            "நெடுஞ்சேரலாதன்" என்பது ஒரு பண்புப் பெயர்.
            <ol>
              <li>நெடு → நீண்ட அல்லது பெரும் (பெருமை குறிக்கும்)</li>
              <li>சேரல் → சேரர் வம்சம் அல்லது சேரநாடு</li>
              <li>ஆதன் → அரசு புரிபவர் </li>
            </ol>
          </p>
          <p>
            நெடுஞ்சேரலாதன், சங்ககால சேர அரசர்களில் முக்கியமானவர். இவர்
            யவனர்களுடன் (கிரேக்க-ரோமானியர்) வர்த்தகத்திலும் போரிலும்
            ஈடுபட்டிருந்தவர். பல மாநிலங்களைக் கடந்து, தற்போதைய வடக்கு இந்திய வரை
            படையெடுத்து வெற்றி பெற்றவர்.இமய மலை வரை சென்று சேர சின்னத்தை
            செதுக்கியவர் என்பது இவர் ஆட்சியின் பெருமையைச் சுட்டுகிறது.
          </p>
          <p>
            கலைஞர்களை கெளரவித்தவர்; கவிஞர் கண்ணனாருக்கு 500 குடியிருப்புகள்,
            வருமான பங்குகள் வழங்கியவர்.
          </p>
          {/* பட்டங்கள் */}
          <div className="heading-div">
            <h3>பட்டங்கள் : </h3>
          </div>
          <ol>
            <li>
              இமயவரம்பன் (இமயமலை வரை தனது ஆட்சியை விரிவுபடுத்தியதால்
              வழங்கப்பட்டது),
            </li>
            <li>
              "அதிராஜா"- மன்னர்களுக்கு மேலான மன்னன்(சேரர் அரசின் மிகப் பெரிய,
              புகழ்பெற்ற மன்னர் என்பதாலும், அவரது ஆட்சி தெற்கே பாண்டியர்கள்,
              வடக்கே சோழர்கள், மேலும் வேங்கடத்தைத் தாண்டியும் பரவியிருந்ததாலும்
              அவரை 'அதிராஜா' என அழைத்தனர்.)
            </li>
          </ol>
          <p>
            அரசியல்திறமை, உணவளிப்பு, போர்திறன் ஆகியவற்றிற்காக பெரிதும்
            போற்றப்பட்டவர்.
          </p>

          {/* ஆட்சி காலம் */}
          <div className="heading-div">
            <h3>ஆட்சி காலம்</h3>
          </div>

          <p>
            ஆட்சி காலம் - கி.பி. 1ஆம் நூற்றாண்டு முடியிலும், 2ஆம் நூற்றாண்டு
            முற்பகுதியிலும் . <br /> ஆட்சி ஆண்டுகள் - 58 ஆண்டுகள்
            (பதிற்றுப்பத்து ஆதாரம்)
          </p>

          {/* சாதனைகள் */}
          <div className="heading-div">
            <h3>முக்கிய சாதனைகள்</h3>
          </div>
          <ol>
            <li>ஏழு மன்னர்களை வென்றவர் </li>
            <li>இமயமலையில் சேர சின்னம் செதுக்கியவர்</li>
            <li>யவன (கிரேக்க-ரோமானிய) மாலுமிகளை வென்று கைப்பற்றியவர் </li>
            <li>கடம்பு குலத்தை வென்று, புனித மரத்தை வேரோடு பிடுங்கியவர் </li>
          </ol>
          {/* family */}
          <br />
          <br />
          <div className="heading-div">
            <h3>குடும்பத்தினார் :</h3>
          </div>
          <br />
          <center>
            <img className="family-img" src={nedunceralathan} alt="" />
          </center>
          <br />
          <br />
          {/*இலக்கியக் குறிப்புகள் */}
          <div className="heading-div">
            <h3>இலக்கியக் குறிப்புகள் : </h3>
          </div>
          <br />
          {/* 1st */}
          <div className="heading-div">
            <h4>1.பதிற்றுப்பத்து</h4>
          </div>
          <ul>
            <li>கவிஞர் : கண்ணனார்</li>
            <li>பகுதி : இரண்டாவது பத்து</li>
            <li>
              விவரம் : நெடும் சேரலாதனின் வாழ்க்கை, படையெடுப்புகள், யவனர்களுடன்
              மோதல், இமயவரம்பு வரை ஆட்சி, கல்வெட்டு செதுக்கல் உள்ளிட்டவை
              வர்ணிக்கப்படுகின்றன.
            </li>
          </ul>
          {/* athitrupaathu imgs */}

          <center>
            <img src={pathitrupaathuimg1} className="ck1img" alt="img1" />
            <img src={pathittrupaathuimg2} className="ck1img" alt="img2" />
          </center>
          <center>
            <img src={pathittrupaathuimg3} className="ck1img" alt="img3" />
          </center>
          <ol>
            <li>மன்னிய பெரும்புகழ் மறுவில் வாய்மொழி</li>
            <p>
              அர்த்தம்:நிலைத்த பெரும் புகழும், கலங்காத உண்மையான வார்த்தைகளும்
              கொண்டவர்.
            </p>
            <li>இன்னிசை முரசின் உதியஞ் சேரற்கு</li>
            <p>
              அர்த்தம்: இனிய ஒலியுடைய முரசம் (பெரியப்பறை) உடைய உதியஞ் சேரர்
              மன்னருக்கே.உதியண்சேரல் என்பவர்; இது நெடுஞ்சேரலாதனின் தந்தை.
            </p>
            <li>வெளியன் வேண்மாள் நல்லினி யீன்றமகன்</li>
            <p>
              அர்த்தம்:வெளியன் என்ற பெயர் கொண்ட வேண்மாள் என்ற நல்ல குலத்தைச்
              சேர்ந்த பெண் பெற்ற மகன்.
            </p>
            <li>அமைவரல் அருவி இமையம்விற் பொறித்து</li>
            <p>
              அர்த்தம்:அமைதியாக ஒழுகும் அருவிகளும் கொண்ட இமயமலை மீது குறி
              வைத்து,
            </p>
            <li>இமிழ்கடல் வேலித் தமிழகம் விளங்கத்</li>
            <p>
              அர்த்தம்:நுரை கடல் (இமிழ் = நுரை) போன்ற கடலால் சூழப்பட்ட தமிழகம்
              முழுவதும் ஒளி பரப்ப,
            </p>
            <li>தன்கோல் நிறீஇத் தகைசால் சிறப்பொடு</li>
            <p>
              அர்த்தம்:தன் ஆட்சி கோலத்தை வைத்துத் (அதாவது ஆட்சி செய்து) அழகு
              மிகுந்த சிறப்புடன்,
            </p>
            <li>பேரிசை மரபின் ஆரியர் வணக்கி</li>
            <p>
              அர்த்தம்:பெரிய புகழ் வாய்ந்த மரபை உடைய ஆரியர்கள் (வடஇந்தியர்கள்)
              கூட இவரை வணங்கினர்.
            </p>
            <li>நயனில் வன்சொல் யவனர்ப் பிணித்து</li>
            <p>
              அர்த்தம்:பார்வைக்கே பயங்கரமாக இருந்த வன்சொல்லும் யவனர்
              (பாரதசீனம்/வெளிநாட்டு வீரர்கள்) போரை வென்று,
            </p>
            <li>நெய்தலைப் பெய்து கைபிற் கொளீஇ</li>
            <p>
              அர்த்தம்:அவர்களிடம் இருந்து நெய்தல் மலர்களால் (அவமானமாக)
              அஞ்சலியெடுத்துப் (அடிமை அடையாளம்) கைப்பற்றினார்.
            </p>
            <li>அருவிலை நன்கலம் வயிரமொடு கொண்டு</li>
            <p>
              அர்த்தம்:விலைமதிப்பில்லாத நல்ல நகைகள் மற்றும் வைரங்களை கைப்பற்றி.
            </p>
            <li>பெருவிரல் மூதூர்த் தந்துபிறர்க் குதவி</li>
            <p>
              அர்த்தம்:பெரும் விரலில் அணிவது போல் மிகச் சிறந்த மூதூர் (பழமையான
              ஊர்கள்) ஒன்றை விலை இல்லாமல் மற்றவர்களுக்குக் கொடுத்து உதவினார்.
            </p>
            <li>அமையார்த் தேய்த்த அணங்குடை நோன்றாள்</li>
            <p>
              அர்த்தம்:அழகிய அணங்குகள் (பெண்கள்/தேவதைகள் போன்றவையோ) வழிபடும்,
              அழிவற்ற புகழுடன் வாழ்ந்தவர்.
            </p>
            <li>இமைய வரம்பன் நெடுஞ்சேர லாதனைக்</li>
            <p>அர்த்தம்:இமயமலை வரம்பு வரை புகழ்பெற்றவர், நெடுஞ்சேரலாதன்.</p>
            <li>குமட்டூர்க் கண்ணனார் பாடினார் பத்துப்பாட்டு</li>
            <p>
              அர்த்தம்:இந்த பாடலை பாடியவர் குமட்டூர் கண்ணனார்; இது
              பத்துப்பாட்டில் இடம்பெற்றது.
            </p>
          </ol>

          {/* 2nd */}
          <div className="heading-div">
            <h4>2.ஐங்குறுநூறு</h4>
          </div>
          <ul>
            <li>ஐங்குறுநூறு - குறிஞ்சி - குறள் 65</li>
            <li>கவிஞர்: ஊருதுறையான் பெருஞ்சித்திரன்</li>
            <li>நாயகன்: நெடுஞ்சேரலாதன்</li>
          </ul>

          {/* ingurunooruck2 */}
          <center>
            <img src={ingurunooruck2} className="ck1img" alt="img1" />
          </center>
          <p>
            இந்த பாடல், நெடுஞ்சேரலாதன் ஒரு போர்க்கள வீரனாக மட்டுமல்லாமல்,
            மென்மையான உள்ளமும், காதல் மனதுமுடைய மனிதராகவும் அவனது பிம்பத்தை
            கட்டமைக்கிறது.
          </p>
          <p>
            சேரர் வீரக்குணங்கள் மற்றும் மரபுகளை பரிந்துரை செய்யும் வகையில் படல
            வார்த்தைகள் உள்ளன.குறிப்பாக, சேர மன்னர்கள் யவனர்களை வென்றது, கடல்
            கடந்த போர்கள் ஆகியவை நெடும்சேரலாதனுடன் தொடர்புபடும்.
          </p>
          <p>
            இது போன்ற பல தகவல்கள் நெடுஞ்சேரலாதனைப் பற்றி சங்க இலக்கியங்களில்
            கிடைக்கின்றன.
          </p>
        </div>
        <br />
        <br />
        <br />

        <div className="chera-footer">
          <p>
            ⚠️ இந்த இணையதளத்தில் பயன்படுத்தப்படும் சில படங்கள் அடிப்படையிலானவை.
            சில படங்கள் பொது பயன்பாட்டிற்கானவையாக (Public Domain) எடுத்தவை.
            வரலாற்று தகவல்கள் தமிழ் வரலாற்று ஆய்வாளர்கள் வழங்கிய ஆதாரங்களை
            அடிப்படையாகக் கொண்டவை. இவை பொதுமக்கள் அறிவிற்கே, அதிகாரப்பூர்வ
            வரலாற்று ஆவணமாகக் கருத வேண்டாம்.
            <br />
            <span> &copy;தமிழர்தேசம்</span>
          </p>
        </div>
      </div>
    </>
  );
}

export default C_k_2;
